---
kind: property
id: P:Autodesk.Revit.DB.ScheduleDefinition.IsValidObject
source: html/5058b98a-5a00-094e-ad16-acadc322e216.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.